###############################################################################
# Created by write_sdc
# Tue Nov 12 14:05:28 2024
###############################################################################
current_design vmsu_8bit_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.9000 [get_clocks {clk}]
set_clock_latency -source -max 5.0000 [get_clocks {clk}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[0]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[0]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[1]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[1]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[2]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[2]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[3]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[3]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[4]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[4]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[5]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[5]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[6]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[6]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[7]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[7]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[0]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[0]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[1]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[1]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[2]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[2]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[3]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[3]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[4]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[4]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[5]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[5]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[6]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[6]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[7]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[7]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {control}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {control}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[0]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[10]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[10]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[11]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[11]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[12]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[12]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[13]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[13]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[14]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[14]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[15]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[15]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[1]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[2]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[3]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[4]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[5]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[6]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[6]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[7]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[7]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[8]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[8]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -min -add_delay [get_ports {p[9]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -max -add_delay [get_ports {p[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {p[15]}]
set_load -pin_load 0.1900 [get_ports {p[14]}]
set_load -pin_load 0.1900 [get_ports {p[13]}]
set_load -pin_load 0.1900 [get_ports {p[12]}]
set_load -pin_load 0.1900 [get_ports {p[11]}]
set_load -pin_load 0.1900 [get_ports {p[10]}]
set_load -pin_load 0.1900 [get_ports {p[9]}]
set_load -pin_load 0.1900 [get_ports {p[8]}]
set_load -pin_load 0.1900 [get_ports {p[7]}]
set_load -pin_load 0.1900 [get_ports {p[6]}]
set_load -pin_load 0.1900 [get_ports {p[5]}]
set_load -pin_load 0.1900 [get_ports {p[4]}]
set_load -pin_load 0.1900 [get_ports {p[3]}]
set_load -pin_load 0.1900 [get_ports {p[2]}]
set_load -pin_load 0.1900 [get_ports {p[1]}]
set_load -pin_load 0.1900 [get_ports {p[0]}]
set_input_transition 0.6100 [get_ports {clk}]
set_input_transition -min 0.0700 [get_ports {control}]
set_input_transition -max 0.8600 [get_ports {control}]
set_input_transition -min 0.0700 [get_ports {a[7]}]
set_input_transition -max 0.8600 [get_ports {a[7]}]
set_input_transition -min 0.0700 [get_ports {a[6]}]
set_input_transition -max 0.8600 [get_ports {a[6]}]
set_input_transition -min 0.0700 [get_ports {a[5]}]
set_input_transition -max 0.8600 [get_ports {a[5]}]
set_input_transition -min 0.0700 [get_ports {a[4]}]
set_input_transition -max 0.8600 [get_ports {a[4]}]
set_input_transition -min 0.0700 [get_ports {a[3]}]
set_input_transition -max 0.8600 [get_ports {a[3]}]
set_input_transition -min 0.0700 [get_ports {a[2]}]
set_input_transition -max 0.8600 [get_ports {a[2]}]
set_input_transition -min 0.0700 [get_ports {a[1]}]
set_input_transition -max 0.8600 [get_ports {a[1]}]
set_input_transition -min 0.0700 [get_ports {a[0]}]
set_input_transition -max 0.8600 [get_ports {a[0]}]
set_input_transition -min 0.0700 [get_ports {b[7]}]
set_input_transition -max 0.8600 [get_ports {b[7]}]
set_input_transition -min 0.0700 [get_ports {b[6]}]
set_input_transition -max 0.8600 [get_ports {b[6]}]
set_input_transition -min 0.0700 [get_ports {b[5]}]
set_input_transition -max 0.8600 [get_ports {b[5]}]
set_input_transition -min 0.0700 [get_ports {b[4]}]
set_input_transition -max 0.8600 [get_ports {b[4]}]
set_input_transition -min 0.0700 [get_ports {b[3]}]
set_input_transition -max 0.8600 [get_ports {b[3]}]
set_input_transition -min 0.0700 [get_ports {b[2]}]
set_input_transition -max 0.8600 [get_ports {b[2]}]
set_input_transition -min 0.0700 [get_ports {b[1]}]
set_input_transition -max 0.8600 [get_ports {b[1]}]
set_input_transition -min 0.0700 [get_ports {b[0]}]
set_input_transition -max 0.8600 [get_ports {b[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 150.0000 [current_design]
